"""
切片
用切边可以选取大多数序列类型的一部分，切片的基本形式是在方括号中使用start:stop
切片的起始元素是包括的，不包含结束元素。因此，结果中包含的元素个数是stop - start
"""
a = [7, 2, 3, 7, 5, 6, 0, 1]
print(a[1:5])
"""
[2, 3, 7, 5]
"""
# 切片也可以被序列赋值：
a[3:4] = [6, 3]
print(a)
"""
[7, 2, 3, 6, 3, 5, 6, 0, 1]
"""
# start或stop都可以被省略，省略之后，分别默认序列的开头和结尾
print(a[:5])
print(a[3:])
"""
[7, 2, 3, 6, 3]
[6, 3, 5, 6, 0, 1]
"""
# 负数表明从后向前切片
print(a[-4:])
print(a[-6:-2])
"""
[5, 6, 0, 1]
[6, 3, 5, 6]
"""
# 在第二个冒号后面使用step，可以隔step取一个元素
# 使用-1，可以将列表或元组颠倒过来
print(a[::2])
print(a[::-1])
"""
[7, 3, 3, 6, 1]
[1, 0, 6, 5, 3, 6, 3, 2, 7]
"""
